mellemhere/-RGBTrip2.0-Firmware/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t INPUT_ADC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_INPUT_ADC_GPIO, BOARD_INITPINS_INPUT_ADC_PIN, &INPUT_ADC_config);

    gpio_pin_config_t IR_OUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_IR_OUT_GPIO, BOARD_INITPINS_IR_OUT_PIN, &IR_OUT_config);

    gpio_pin_config_t LED1_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_R_GPIO, BOARD_INITPINS_LED1_R_PIN, &LED1_R_config);

    gpio_pin_config_t LED1_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_G_GPIO, BOARD_INITPINS_LED1_G_PIN, &LED1_G_config);

    gpio_pin_config_t LED6_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_LED6_G_GPIO, BOARD_INITPINS_LED6_G_PIN, &LED6_G_config);

    gpio_pin_config_t LED1_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB10 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_B_GPIO, BOARD_INITPINS_LED1_B_PIN, &LED1_B_config);

    gpio_pin_config_t LED2_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB11 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_R_GPIO, BOARD_INITPINS_LED2_R_PIN, &LED2_R_config);

    gpio_pin_config_t LED3_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_LED3_G_GPIO, BOARD_INITPINS_LED3_G_PIN, &LED3_G_config);

    gpio_pin_config_t LED3_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_LED3_B_GPIO, BOARD_INITPINS_LED3_B_PIN, &LED3_B_config);

    gpio_pin_config_t LED3_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB20 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_LED3_R_GPIO, BOARD_INITPINS_LED3_R_PIN, &LED3_R_config);

    gpio_pin_config_t LED_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB22 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_LED_RED_GPIO, BOARD_INITPINS_LED_RED_PIN, &LED_RED_config);

    gpio_pin_config_t LED7_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_LED7_R_GPIO, BOARD_INITPINS_LED7_R_PIN, &LED7_R_config);

    gpio_pin_config_t LED5_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_LED5_R_GPIO, BOARD_INITPINS_LED5_R_PIN, &LED5_R_config);

    gpio_pin_config_t LED4_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_LED4_R_GPIO, BOARD_INITPINS_LED4_R_PIN, &LED4_R_config);

    gpio_pin_config_t LED7_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_LED7_B_GPIO, BOARD_INITPINS_LED7_B_PIN, &LED7_B_config);

    gpio_pin_config_t LED8_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(BOARD_INITPINS_LED8_R_GPIO, BOARD_INITPINS_LED8_R_PIN, &LED8_R_config);

    gpio_pin_config_t LED8_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 76)  */
    GPIO_PinInit(BOARD_INITPINS_LED8_B_GPIO, BOARD_INITPINS_LED8_B_PIN, &LED8_B_config);

    gpio_pin_config_t LED5_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_LED5_B_GPIO, BOARD_INITPINS_LED5_B_PIN, &LED5_B_config);

    gpio_pin_config_t LED5_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(BOARD_INITPINS_LED5_G_GPIO, BOARD_INITPINS_LED5_G_PIN, &LED5_G_config);

    gpio_pin_config_t LED4_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(BOARD_INITPINS_LED4_G_GPIO, BOARD_INITPINS_LED4_G_PIN, &LED4_G_config);

    gpio_pin_config_t LED4_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(BOARD_INITPINS_LED4_B_GPIO, BOARD_INITPINS_LED4_B_PIN, &LED4_B_config);

    gpio_pin_config_t LED2_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_B_GPIO, BOARD_INITPINS_LED2_B_PIN, &LED2_B_config);

    gpio_pin_config_t LED2_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin 83)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_G_GPIO, BOARD_INITPINS_LED2_G_PIN, &LED2_G_config);

    gpio_pin_config_t LED8_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 84)  */
    GPIO_PinInit(BOARD_INITPINS_LED8_G_GPIO, BOARD_INITPINS_LED8_G_PIN, &LED8_G_config);

